
## Terraform Plan 📖
<details>
<summary>Click to expand</summary>

```HCL

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.master_nodes[0].proxmox_vm_qemu.vm will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=virtio0"
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + ciuser                 = "debian"
      + clone                  = "packer-debian-13.0.0-20250813104205"
      + clone_wait             = 10
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.9.9.50/24,gw=10.9.9.1"
      + ipconfig1              = "ip=10.9.8.50/24"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "kube-master-01"
      + nameserver             = "10.9.9.1"
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = (sensitive value)
      + tablet                 = true
      + tags                   = "k3s,master"
      + target_node            = "pve"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = 200

      + cpu {
          + cores   = 1
          + limit   = 0
          + numa    = false
          + sockets = 1
          + type    = "host"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide2 {
                  + cloudinit {
                      + storage = "local-zfs"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "vmpool"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }
      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

  # module.worker_nodes[0].proxmox_vm_qemu.vm will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=virtio0"
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + ciuser                 = "debian"
      + clone                  = "packer-debian-13.0.0-20250813104205"
      + clone_wait             = 10
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.9.9.51/24,gw=10.9.9.1"
      + ipconfig1              = "ip=10.9.8.51/24"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 32768
      + name                   = "kube-worker-01"
      + nameserver             = "10.9.9.1"
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = (sensitive value)
      + tablet                 = true
      + tags                   = "k3s,worker"
      + target_node            = "pve"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = 201

      + cpu {
          + cores   = 6
          + limit   = 0
          + numa    = false
          + sockets = 1
          + type    = "host"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide2 {
                  + cloudinit {
                      + storage = "local-zfs"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "vmpool"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }
      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

  # module.worker_nodes[1].proxmox_vm_qemu.vm will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=virtio0"
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + ciuser                 = "debian"
      + clone                  = "packer-debian-13.0.0-20250813104205"
      + clone_wait             = 10
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.9.9.52/24,gw=10.9.9.1"
      + ipconfig1              = "ip=10.9.8.52/24"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 32768
      + name                   = "kube-worker-02"
      + nameserver             = "10.9.9.1"
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = (sensitive value)
      + tablet                 = true
      + tags                   = "k3s,worker"
      + target_node            = "pve"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = 202

      + cpu {
          + cores   = 6
          + limit   = 0
          + numa    = false
          + sockets = 1
          + type    = "host"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide2 {
                  + cloudinit {
                      + storage = "local-zfs"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "vmpool"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }
      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @MrStarktastic, Action: `pull_request`*